УТ_для_edt.РасширениеСмарт/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОбособленнаяЗакупкаПродажа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОформленияПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АлкогольнаяПродукцияВоВскрытойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СезоннаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>РейтингПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Марка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоллекцияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоэффициентЕдиницыДляОтчетов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СхемаОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Качество</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетСертификатовНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d7abca0-ac91-4ef9-a1ad-32697b4607d2">
    <name>смартНаименованиеСайт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="13dd1676-d9c6-415f-a4e1-cb9414a09577">
    <name>ЕдиницаИзмеренияТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="deac0f00-4a8f-4d18-a043-7799a7111d39">
    <name>КодВидаНоменклатурнойКлассификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="064e5a5a-2e2f-47ca-9f01-32f70a8b1c1e">
    <name>НаименованиеВидаНоменклатурнойКлассификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ДрагоценныеМатериалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДрагоценныйМатериал</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Расположение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="344b6917-b413-4fae-aadd-d62836822de6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/НоменклатураПродаваемаяСовместно/НоменклатураПродаваемаяСовместно.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3eb5ffef-8dc3-45c2-ace4-68651cb11634">
  <name>НоменклатураПродаваемаяСовместно</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="6f57b8df-9796-4249-bd20-b45e3d7c7100">
    <name>НоменклатураПредпосылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8e896ce7-7a99-49b9-ab7e-95f9844ebe98">
    <name>НоменклатураСледствие</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Номенклатура/Forms/СовместныеПродажи/Module.bsl
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ смарт:ММ #052 300 09.06.2020 - Групповое заполнение совместно продаваемой номенклатуры  
	смартДобавитьЭлементыПрограммно();
	//-- смарт:ММ 09.06.2020
	
КонецПроцедуры

//++ смарт:ММ #052 300 09.06.2020 - Групповое заполнение совместно продаваемой номенклатуры  
&НаСервере
Процедура смартДобавитьЭлементыПрограммно()
	
	Команда = ЭтаФорма.Команды.Добавить("смартСоздатьНесколько");
    Команда.Действие = "смартСоздатьНесколькоНажатие";

	Если Элементы.Найти("смартСоздатьНесколько") = Неопределено Тогда 		
		Кнопка = Элементы.Добавить("смартСоздатьНесколько", Тип("КнопкаФормы"), Элементы.НоменклатураПродаваемаяСовместноСДанной.КоманднаяПанель);
		Кнопка.Заголовок	= "Создать несколько (смарт)";
		Кнопка.ИмяКоманды	= "смартСоздатьНесколько";
	КонецЕсли;
	
	//++ смарт:ММ #103 495 18.04.2021 
	Команда = ЭтаФорма.Команды.Добавить("смартСоздатьНесколько2");
    Команда.Действие = "смартСоздатьНесколькоНажатие2";

	Если Элементы.Найти("смартСоздатьНесколько2") = Неопределено Тогда 		
		Кнопка = Элементы.Добавить("смартСоздатьНесколько2", Тип("КнопкаФормы"), Элементы.НоменклатураСКоторойПродаетсяСовместноДанная.КоманднаяПанель);
		Кнопка.Заголовок	= "Создать несколько (смарт)";
		Кнопка.ИмяКоманды	= "смартСоздатьНесколько2";
	КонецЕсли;
	
	Команда = ЭтаФорма.Команды.Добавить("смартСкопироватьДругим");
    Команда.Действие = "смартСкопироватьДругимНажатие";

	Если Элементы.Найти("смартСкопироватьДругим") = Неопределено Тогда 		
		Кнопка = Элементы.Добавить("смартСкопироватьДругим", Тип("КнопкаФормы"), Элементы.НоменклатураПродаваемаяСовместноСДанной.КоманднаяПанель);
		Кнопка.Заголовок	= "Скопировать другим (смарт)";
		Кнопка.ИмяКоманды	= "смартСкопироватьДругим";
	КонецЕсли;

	Команда = ЭтаФорма.Команды.Добавить("смартСкопироватьДругим2");
    Команда.Действие = "смартСкопироватьДругимНажатие";

	Если Элементы.Найти("смартСкопироватьДругим2") = Неопределено Тогда 		
		Кнопка = Элементы.Добавить("смартСкопироватьДругим2", Тип("КнопкаФормы"), Элементы.НоменклатураСКоторойПродаетсяСовместноДанная.КоманднаяПанель);
		Кнопка.Заголовок	= "Скопировать другим (смарт)";
		Кнопка.ИмяКоманды	= "смартСкопироватьДругим2";
	КонецЕсли;

	//-- смарт:ММ 18.04.2021
	
КонецПроцедуры //-- смарт:ММ 09.06.2020

//++ смарт:ММ #052 300 09.06.2020 - Групповое заполнение совместно продаваемой номенклатуры  
&НаКлиенте
Процедура смартСоздатьНесколькоНажатие(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОтборНоменклатура", ОтборНоменклатура);
	//++ смарт:ММ #103 495 18.04.2021 
	ПараметрыОткрытия.Вставить("Режим", 1);
	//-- смарт:ММ 18.04.2021
	ОткрытьФорму("Справочник.Номенклатура.Форма.смарт_ЗаполнениеСовместныхПродаж", ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
   
КонецПроцедуры //-- смарт:ММ 09.06.2020

//++ смарт:ММ #052 300 10.06.2020 - Групповое заполнение совместно продаваемой номенклатуры  
&НаКлиенте
Процедура смарт_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "смартИзмененРегистрНоменклатураПродаваемаяСовместно" Тогда
		Элементы.НоменклатураПродаваемаяСовместноСДанной.Обновить();
	//++ смарт:ММ #103 495 18.04.2021 
		Элементы.НоменклатураСКоторойПродаетсяСовместноДанная.Обновить();	
	//-- смарт:ММ 18.04.2021
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 10.06.2020

//++ смарт:ММ #103 495 18.04.2021 
&НаКлиенте
Процедура смартСоздатьНесколькоНажатие2(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОтборНоменклатура", ОтборНоменклатура);
	ПараметрыОткрытия.Вставить("Режим", 2);
	ОткрытьФорму("Справочник.Номенклатура.Форма.смарт_ЗаполнениеСовместныхПродаж", ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
   
КонецПроцедуры //-- смарт:ММ 18.04.2021

//++ смарт:ММ #103 495 18.04.2021 
&НаКлиенте
Процедура смартСкопироватьДругимНажатие(Команда)
	
	ОписаниеОпопвещенияОЗакрытии = Новый ОписаниеОповещения("смартПослеЗакрытияСкопироватьДругим", ЭтотОбъект);
	ОткрытьФорму("Справочник.Номенклатура.Форма.смарт_ПодобраннаяНоменклатура", , ЭтаФорма,,,, ОписаниеОпопвещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- смарт:ММ 18.04.2021

//++ смарт:ММ #103 495 18.04.2021 
&НаКлиенте
Процедура смартПослеЗакрытияСкопироватьДругим(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда
		смартСкопироватьДругимСервер(РезультатЗакрытия);
		Оповестить("смартИзмененРегистрНоменклатураПродаваемаяСовместно");
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 18.04.2021

//++ смарт:ММ #103 495 18.04.2021 
&НаСервере
Процедура смартСкопироватьДругимСервер(МассивНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка,
	|	НоменклатураПродаваемаяСовместно.ХарактеристикаПредпосылка,
	|	НоменклатураПродаваемаяСовместно.НоменклатураСледствие,
	|	НоменклатураПродаваемаяСовместно.ХарактеристикаСледствие,
	|	НоменклатураПродаваемаяСовместно.ВариантАнализа,
	|	НоменклатураПродаваемаяСовместно.ДобавленоАвтоматически,
	|	НоменклатураПродаваемаяСовместно.ПроцентСлучаев,
	|	НоменклатураПродаваемаяСовместно.КоличествоСлучаев
	|ИЗ
	|	РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
	|ГДЕ 
	|   НоменклатураПродаваемаяСовместно.НоменклатураСледствие = &Номенклатура
	|";

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНоменклатураПродаваемаяСовместноСДанной Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НоменклатураПродаваемаяСовместно.НоменклатураСледствие = &Номенклатура", "НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка = &Номенклатура");
		Режим = 1;
	Иначе
		Режим = 2;
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Номенклатура", ЭтаФорма.ОтборНоменклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого ЭлементМассива Из МассивНоменклатуры Цикл
			
			МенеджерЗаписи = РегистрыСведений.НоменклатураПродаваемаяСовместно.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			
			Если Режим = 1 Тогда
				МенеджерЗаписи.НоменклатураПредпосылка 		= ЭлементМассива;
				МенеджерЗаписи.ХарактеристикаПредпосылка 	= Неопределено;			
			Иначе
				МенеджерЗаписи.НоменклатураСледствие 		= ЭлементМассива;
				МенеджерЗаписи.ХарактеристикаСледствие 		= Неопределено;			
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 18.04.2021
